Repository: Aparialtech/Kyradi-app
Catalog: lib/l10n/app_*.arb
Languages: de, es, ru

source: Dashboard
de: Startseite
es: Inicio
ru: Главная

source: Profile
de: Profil
es: Perfil
ru: Профиль

source: Settings
de: Einstellungen
es: Configuración
ru: Настройки

# findLocation
source: Find My Location
de: Meinen Standort finden
es: Encontrar mi ubicación
ru: Найти мое местоположение

source: Destination
de: Ziel
es: Destino
ru: Пункт назначения

# transitRoute
source: Public Transit Route
de: Öffentliche Verkehrsroute
es: Ruta de transporte público
ru: Маршрут общественного транспорта

source: My Luggages
de: Mein Gepäck
es: Mis maletas
ru: Мои чемоданы

source: Add Luggage (QR)
de: Gepäck hinzufügen (QR)
es: Agregar equipaje (QR)
ru: Добавить багаж (QR)

source: New luggage added ✅
de: Neues Gepäck hinzugefügt ✅
es: Nuevo equipaje agregado ✅
ru: Новый багаж добавлен ✅

source: Save
de: Speichern
es: Guardar
ru: Сохранить

# saveProfile
source: Profile saved ✅
de: Profil gespeichert ✅
es: Perfil guardado ✅
ru: Профиль сохранен ✅

# saveProfileError
source: Save failed
de: Speichern fehlgeschlagen
es: Error al guardar
ru: Не удалось сохранить

# userInfo
source: User Information
de: Benutzerinformationen
es: Información del usuario
ru: Информация о пользователе

source: Map
de: Karte
es: Mapa
ru: Карта

# mapIntro
source: See KYRADI spots on the map and build your best route.
de: Sieh dir die KYRADI-Standorte auf der Karte an und plane die beste Route.
es: Consulta los puntos KYRADI en el mapa y planifica la mejor ruta.
ru: Смотрите точки KYRADI на карте и строите лучший маршрут.

source: Walking Route
de: Fußweg
es: Ruta a pie
ru: Пеший маршрут

source: Driving Route
de: Fahrtroute
es: Ruta en coche
ru: Маршрут на авто

# openInMaps
source: Open in Google Maps
de: In Google Maps öffnen
es: Abrir en Google Maps
ru: Открыть в Google Картах

source: Route options
de: Routenoptionen
es: Opciones de ruta
ru: Варианты маршрута

source: First Name
de: Vorname
es: Nombre
ru: Имя

source: Last Name
de: Nachname
es: Apellido
ru: Фамилия

# fullNameLabel
source: Full Name
de: Vollständiger Name
es: Nombre completo
ru: Полное имя

source: Phone
de: Telefon
es: Teléfono
ru: Телефон

source: Email
es: Correo electrónico
ru: Эл. почта

source: Address
de: Adresse
es: Dirección
ru: Адрес

source: Birth Date
de: Geburtsdatum
es: Fecha de nacimiento
ru: Дата рождения

source: Gender
de: Geschlecht
es: Género
ru: Пол

source: Emergency Contact
de: Notfallkontakt
es: Contacto de emergencia
ru: Экстренный контакт

# note
source: Note / Description
de: Notiz / Beschreibung
es: Nota / Descripción
ru: Заметка / Описание

source: Camera Permission
de: Kamerazugriff
es: Permiso de cámara
ru: Разрешение на камеру

# cameraPermissionDesc
source: Required for QR scanning
de: Erforderlich zum QR-Scannen
es: Requerido para escanear QR
ru: Требуется для сканирования QR

source: Location Permission
de: Standortzugriff
es: Permiso de ubicación
ru: Разрешение на геолокацию

# locationPermissionDesc
source: Required for public transit and location features
de: Für Routen und Standortfunktionen erforderlich
es: Requerido para transporte público y funciones de ubicación
ru: Для транспорта и функций местоположения

source: Notification Permission
de: Benachrichtigungszugriff
es: Permiso de notificación
ru: Разрешение на уведомления

# notificationPermissionDesc
source: For reminders and updates
de: Für Erinnerungen und Updates
es: Para recordatorios y actualizaciones
ru: Для напоминаний и обновлений

source: In-App Notifications
de: In-App-Benachrichtigungen
es: Notificaciones en la aplicación
ru: Уведомления в приложении

source: Notification Sound
de: Benachrichtigungston
es: Sonido de notificación
ru: Звук уведомления

# notificationVibrate
source: Vibration
es: Vibración
ru: Вибрация

source: Account
de: Konto
es: Cuenta
ru: Аккаунт

source: Change Password
de: Passwort ändern
es: Cambiar contraseña
ru: Сменить пароль

source: Logout
de: Abmelden
es: Cerrar sesión
ru: Выйти

source: About
de: Über
es: Acerca de
ru: О приложении

# aboutApp
source: This app was developed by KYRADI.
de: Diese App wurde von KYRADI entwickelt.
es: Esta aplicación fue desarrollada por KYRADI.
ru: Это приложение разработано KYRADI.

source: QR Code
es: Código QR
ru: QR-код

# weight
source: Weight (kg)
de: Gewicht (kg)
es: Peso (kg)
ru: Вес (кг)

source: Size
de: Größe
es: Tamaño
ru: Размер

source: Small
de: Klein
es: Pequeño
ru: Маленький

source: Medium
de: Mittel
es: Mediano
ru: Средний

source: Large
de: Groß
es: Grande
ru: Большой

source: Black
de: Schwarz
es: Negro
ru: Чёрный

source: Red
de: Rot
es: Rojo
ru: Красный

source: Blue
de: Blau
es: Azul
ru: Синий

source: Grey
de: Grau
es: Gris
ru: Серый

source: Other
de: Andere
es: Otro
ru: Другой

source: Save Luggage
de: Gepäck speichern
es: Guardar equipaje
ru: Сохранить багаж

# qrEmptyError
source: QR code cannot be empty ❌
de: QR-Code darf nicht leer sein ❌
es: El código QR no puede estar vacío ❌
ru: QR-код не может быть пустым ❌

source: Old Password
de: Altes Passwort
es: Contraseña anterior
ru: Старый пароль

source: New Password
de: Neues Passwort
es: Nueva contraseña
ru: Новый пароль

source: Confirm New Password
de: Neues Passwort bestätigen
es: Confirmar nueva contraseña
ru: Подтвердите новый пароль

source: Password changed ✅
de: Passwort geändert ✅
es: Contraseña cambiada ✅
ru: Пароль изменён ✅

# passwordMismatch
source: New passwords do not match ❌
de: Neue Passwörter stimmen nicht überein ❌
es: Las nuevas contraseñas no coinciden ❌
ru: Новые пароли не совпадают ❌

# languageChanged
source: Language changed to English ✅
de: Sprache geändert ✅
es: Idioma cambiado ✅
ru: Язык изменён ✅

# permissionGranted
source: {permission} permission granted ✅
de: {permission}-Berechtigung erteilt ✅
es: Permiso de {permission} concedido ✅
ru: Разрешение {permission} предоставлено ✅

# permissionDenied
source: {permission} permission denied ❌
de: {permission}-Berechtigung verweigert ❌
es: Permiso de {permission} denegado ❌
ru: Разрешение {permission} отклонено ❌

# permissionDeniedForever
source: {permission} permission permanently denied, enable from settings ⚙️
de: {permission}-Berechtigung dauerhaft verweigert, in den Einstellungen aktivieren ⚙️
es: Permiso de {permission} denegado permanentemente, actívalo en la configuración ⚙️
ru: Разрешение {permission} отклонено навсегда, включите в настройках ⚙️

# locationReceived
source: Location received 📍 {lat}, {lng}
de: Standort erhalten 📍 {lat}, {lng}
es: Ubicación recibida 📍 {lat}, {lng}
ru: Местоположение получено 📍 {lat}, {lng}

# locationFailed
source: Failed to get location ❌
de: Standort konnte nicht abgerufen werden ❌
es: No se pudo obtener la ubicación ❌
ru: Не удалось получить местоположение ❌

source: Profile saved ✅
de: Profil gespeichert ✅
es: Perfil guardado ✅
ru: Профиль сохранён ✅

# profileSaveError
source: Profile could not be saved ❌
de: Profil konnte nicht gespeichert werden ❌
es: No se pudo guardar el perfil ❌
ru: Не удалось сохранить профиль ❌

# logoutSuccess
source: Logged out successfully 👋
de: Erfolgreich abgemeldet 👋
es: Cierre de sesión exitoso 👋
ru: Вы успешно вышли 👋

# copyrightNotice
source: © 2025 KYRADI. All rights reserved.
de: © 2025 KYRADI. Alle Rechte vorbehalten.
es: © 2025 KYRADI. Todos los derechos reservados.
ru: © 2025 KYRADI. Все права защищены.

# demoMapComingSoon
source: Map module will open soon.
de: Das Kartenmodul wird in Kürze geöffnet.
es: El módulo de mapas se abrirá pronto.
ru: Модуль карты скоро откроется.

# demoLuggageButton
source: Luggage {number}
de: Gepäck {number}
es: Equipaje {number}
ru: Багаж {number}

# demoLuggageSelected
source: {label} selected.
de: {label} ausgewählt.
es: Se seleccionó {label}.
ru: Выбран {label}.

# demoAddressValue
source: Istanbul, Türkiye
de: Istanbul, Türkei
es: Estambul, Turquía
ru: Стамбул, Турция

# demoEmergencyAddressValue
source: Kadıköy, Istanbul
es: Kadıköy, Estambul
ru: Кадыкёй, Стамбул

# demoEmergencyRelationValue
source: Sibling / Close Relative
de: Geschwister / naher Verwandter
es: Hermano/a o familiar cercano
ru: Брат / сестра или близкий родственник

# emergencyContactNote
source: This person will be contacted in emergencies.
de: Diese Person wird im Notfall kontaktiert.
es: Esta persona será contactada en emergencias.
ru: С этим человеком свяжутся в экстренных ситуациях.

# introTagline
source: Global luggage system
de: Globales Gepäcksystem
es: Sistema global de equipaje
ru: Глобальная система чемоданов

# introTrackButton
source: Track
de: Verfolgen
es: Rastrear
ru: Отслеживать

# serverButtonLabel
source: Server
es: Servidor
ru: Сервер

# serverStatus
source: Server: {host}
es: Servidor: {host}
ru: Сервер: {host}

# loginHeroSubtitle
source: Manage your luggage after signing in.
de: Verwalte dein Gepäck nach dem Anmelden.
es: Administra tu equipaje después de iniciar sesión.
ru: Управляйте багажом после входа.

# loginFormTitle
source: Sign-in details
de: Anmeldedaten
es: Datos de inicio de sesión
ru: Данные для входа

# loginFormSubtitle
source: Connect to the latest server to sign in.
de: Verbinde dich mit dem neuesten Server, um dich anzumelden.
es: Conéctate al servidor más actualizado para iniciar sesión.
ru: Подключитесь к актуальному серверу, чтобы войти.

# emailHint
source: example@mail.com
de: beispiel@mail.com
es: ejemplo@mail.com

# passwordLabel
source: Password
de: Passwort
es: Contraseña
ru: Пароль

# validationEmailRequired
source: Email is required
de: E-Mail ist erforderlich
es: El correo es obligatorio
ru: E-mail обязателен

# validationEmailInvalid
source: Enter a valid email
de: Gib eine gültige E-Mail ein
es: Introduce un correo válido
ru: Введите корректный e-mail

# validationPasswordRequired
source: Password is required
de: Passwort ist erforderlich
es: La contraseña es obligatoria
ru: Пароль обязателен

# validationMinChars
source: Enter at least {count} characters
de: Mindestens {count} Zeichen eingeben
es: Escribe al menos {count} caracteres
ru: Введите минимум {count} символов

# loginForgotPassword
source: Forgot password
de: Passwort vergessen
es: Olvidé mi contraseña
ru: Забыл пароль

# clearButton
source: Clear
de: Leeren
es: Limpiar
ru: Очистить

# loginButtonLabel
source: Sign in
de: Anmelden
es: Iniciar sesión
ru: Войти

# loginSocialDivider
source: or
de: oder
es: o
ru: или

# loginContinueWithGoogle
source: Continue with Google
de: Weiter mit Google
es: Continuar con Google
ru: Продолжить с Google

# loginContinueWithApple
source: Continue with Apple
de: Weiter mit Apple
es: Continuar con Apple
ru: Продолжить с Apple

# loginSocialComingSoon
source: {provider} will be available soon.
de: {provider} ist bald verfügbar.
es: {provider} estará disponible pronto.
ru: {provider} скоро будет доступен.

# loginNoAccount
source: Don't have an account?
de: Kein Konto?
es: ¿No tienes cuenta?
ru: Нет аккаунта?

# registerButtonLabel
source: Register
de: Registrieren
es: Registrarse
ru: Зарегистрироваться

# loginSuccess
source: Signed in successfully ✅
de: Erfolgreich angemeldet ✅
es: Inicio de sesión exitoso ✅
ru: Вход выполнен ✅

# loginInvalidCredentials
source: Email or password is incorrect ❌
de: E-Mail oder Passwort falsch ❌
es: Correo o contraseña incorrectos ❌
ru: Неверный e-mail или пароль ❌

# loginTooManyAttempts
source: Too many attempts, please try again in a few minutes ⚠️
de: Zu viele Versuche, bitte in ein paar Minuten erneut versuchen ⚠️
es: Demasiados intentos, inténtalo de nuevo en unos minutos ⚠️
ru: Слишком много попыток, повторите через несколько минут ⚠️

# loginFailed
source: Sign-in failed, please try again ❌
de: Anmeldung fehlgeschlagen, versuch es erneut ❌
es: El inicio de sesión falló, inténtalo de nuevo ❌
ru: Не удалось войти, попробуйте снова ❌

# genericErrorWithDetails
source: An error occurred: {details}
de: Es ist ein Fehler aufgetreten: {details}
es: Ocurrió un error: {details}
ru: Произошла ошибка: {details}

# loginVerificationRequired
source: Please verify your account 📨
de: Bitte bestätige dein Konto 📨
es: Verifica tu cuenta 📨
ru: Пожалуйста, подтвердите аккаунт 📨

# verificationSendFailedWithDetails
source: Verification code could not be sent: {details}
de: Bestätigungscode konnte nicht gesendet werden: {details}
es: No se pudo enviar el código de verificación: {details}
ru: Не удалось отправить код подтверждения: {details}

# registerTitle
source: Create account
de: Konto erstellen
es: Crear cuenta
ru: Создать аккаунт

# registerPersonalSectionTitle
source: Personal information
de: Persönliche Angaben
es: Información personal
ru: Личные данные

# registerPersonalSectionSubtitle
source: Share your identity and birth date.
de: Gib Identität und Geburtsdatum an.
es: Comparte tu identidad y fecha de nacimiento.
ru: Укажите удостоверение личности и дату рождения.

# genderMale
source: Male
de: Männlich
es: Hombre
ru: Мужской

# genderFemale
source: Female
de: Weiblich
es: Mujer
ru: Женский

# genderUndisclosed
source: Prefer not to say
de: Möchte ich nicht sagen
es: Prefiero no decir
ru: Не указывать

# registerContactSectionTitle
source: Contact information
de: Kontaktinformationen
es: Información de contacto
ru: Контактная информация

# registerContactSectionSubtitle
source: Email and verification details
de: E-Mail und Verifizierungsdaten
es: Tu correo y datos de verificación
ru: E-mail и данные для подтверждения

# nationalIdLabel
source: National ID number
de: Personalausweisnummer
es: Número de identificación
ru: Номер удостоверения личности

# registerSecuritySectionTitle
source: Security
de: Sicherheit
es: Seguridad
ru: Безопасность

# registerSecuritySectionSubtitle
source: Set and confirm your password
de: Passwort festlegen und bestätigen
es: Define y confirma tu contraseña
ru: Задайте и подтвердите пароль

# registerPasswordRepeatLabel
source: Repeat password
de: Passwort wiederholen
es: Repite la contraseña
ru: Повторите пароль

# registerCaptchaLabel
source: I'm not a robot
de: Ich bin kein Roboter
es: No soy un robot
ru: Я не робот

# registerCaptchaWarning
source: Please check "I'm not a robot"
de: Bitte "Ich bin kein Roboter" markieren
es: Marca "No soy un robot"
ru: Отметьте «Я не робот»

# registerKvkkAgreementLabel
source: I have read and accept the KYRADI KVKK Disclosure.
de: Ich habe den KYRADI-KVKK-Aufklärungstext gelesen und akzeptiere ihn.
es: He leído y acepto el aviso de privacidad KVKK de KYRADI.
ru: Я прочитал и принимаю уведомление KVKK компании KYRADI.

# registerKvkkAgreementWarning
source: Please accept the KVKK disclosure.
de: Bitte akzeptiere den KVKK-Aufklärungstext.
es: Acepta el aviso de privacidad KVKK.
ru: Пожалуйста, примите уведомление KVKK.

# registerRestrictedAgreementLabel
source: I have read and accept the items rejected by Aparial and general transport companies.
de: Ich habe die von Aparial und allgemeinen Transportunternehmen abgelehnten Gegenstände gelesen und akzeptiere sie.
es: He leído y acepto la lista de artículos rechazados por Aparial y las empresas de transporte.
ru: Я прочитал и принимаю список предметов, которые Aparial и перевозчики не принимают.

# registerRestrictedAgreementWarning
source: Please confirm the restricted items document.
de: Bitte bestätige das Dokument zu abgelehnten Gegenständen.
es: Confirma el documento de artículos restringidos.
ru: Пожалуйста, подтвердите документ с запрещёнными предметами.

# registerAgreementView
source: View document
de: Dokument anzeigen
es: Ver documento
ru: Показать документ

# registerKvkkDialogTitle
source: KYRADI – KVKK Disclosure
de: KYRADI – KVKK-Aufklärungstext
es: KYRADI – Aviso de Privacidad KVKK
ru: KYRADI – уведомление KVKK

# registerRestrictedDialogTitle
source: Items Rejected by Aparial and General Transport Companies
de: Von Aparial und allgemeinen Transportunternehmen abgelehnte Gegenstände
es: Artículos rechazados por Aparial y las empresas de transporte
ru: Предметы, которые отклоняют Aparial и транспортные компании
