Repository: Aparialtech/Kyradi-app
Catalog: lib/l10n/app_*.arb
Languages: de, es, ru

# dashboardMetricAwaiting
source: Awaiting Drop
de: Wartet auf Abgabe
es: Pendiente de entrega
ru: Ожидает сдачи

# dashboardMetricStored
source: Stored
de: Eingelagert
es: Almacenado
ru: На хранении

# dashboardMetricPicked
source: Picked Up
de: Abgeholt
es: Retirado
ru: Выдано

# dashboardMetricCancelled
source: Cancelled
de: Storniert
es: Cancelado
ru: Отменено

# deliverySectionTitle
source: Delivery & Route
de: Abgabe & Route
es: Entrega y ruta
ru: Доставка и маршрут

# deliverySectionSubtitle
source: Choose a drop point and open the route.
de: Wähle einen Abgabeort und öffne die Route.
es: Elige un punto de entrega y abre la ruta.
ru: Выбери пункт сдачи и открой маршрут.

# deliveryPointLabel
source: Drop Point
de: Abgabepunkt
es: Punto de entrega
ru: Пункт сдачи

# deliveryPointOption
source: {name} • {available}/{total} free
de: {name} • Frei {available}/{total}
es: {name} • Libre {available}/{total}
ru: {name} • Свободно {available}/{total}

# deliveryPointSelected
source: Drop point selected: {name} ✅
de: Abgabepunkt ausgewählt: {name} ✅
es: Punto de entrega seleccionado: {name} ✅
ru: Пункт сдачи выбран: {name} ✅

# routeNeedLocation
source: Use "Find My Location" first.
de: Nutze zuerst "Meinen Standort finden".
es: Primero usa «Encontrar mi ubicación».
ru: Сначала нажмите «Найти моё местоположение».

# routeNeedDestination
source: Please enter a destination.
de: Bitte gib ein Ziel ein.
es: Ingresa un destino.
ru: Укажите пункт назначения.

# mapsOpenFailed
source: Google Maps could not be opened.
de: Google Maps konnte nicht geöffnet werden.
es: No se pudo abrir Google Maps.
ru: Не удалось открыть Google Maps.

# reservationSectionTitle
source: Reservation Statuses
de: Reservierungsstatus
es: Estados de reserva
ru: Статусы бронирований

# reservationSectionSubtitle
source: Check availability and occupancy details.
de: Sieh dir Verfügbarkeit und Auslastung an.
es: Consulta la disponibilidad y los detalles de ocupación.
ru: Смотри доступность и занятость точек.

# luggagesSectionSubtitle
source: Show QR codes and complete drop/pickup steps.
de: Zeige QR-Codes und schließe Abgabe- bzw. Abholschritte ab.
es: Muestra códigos QR y completa los pasos de entrega/recogida.
ru: Показывай QR-коды и завершай шаги сдачи/получения.

# newLuggageButton
source: New Luggage
de: Neues Gepäck
es: Nuevo equipaje
ru: Новый багаж

# luggageFilterAll
source: All
de: Alle
es: Todos
ru: Все

# luggageFilterAwaiting
source: Awaiting Drop
de: Wartet auf Abgabe
es: Pendiente de entrega
ru: Ожидает сдачи

# luggageFilterStored
source: Stored
de: Eingelagert
es: Almacenado
ru: На хранении

# luggageFilterPicked
source: Picked Up
de: Abgeholt
es: Retirado
ru: Выдано

# luggageEmptyStateNoItems
source: No luggage yet. Add your first bag!
de: Noch kein Gepäck. Füge jetzt eines hinzu!
es: Aún no hay equipaje. ¡Agrega tu primera maleta!
ru: Багаж ещё не добавлен. Создайте первый!

# luggageEmptyStateFiltered
source: No luggage found for this filter.
de: Für diesen Filter wurde kein Gepäck gefunden.
es: No se encontró equipaje para este filtro.
ru: Для этого фильтра багаж не найден.

# profileInfoSubtitle
source: Keep your contact information up to date.
de: Halte deine Kontaktdaten aktuell.
es: Mantén actualizada tu información de contacto.
ru: Держите контактные данные в актуальном состоянии.

# emergencySectionSubtitle
source: Add a trusted contact to stay safe.
de: Füge eine Vertrauensperson hinzu, um sicher zu bleiben.
es: Agrega un contacto de confianza para mayor seguridad.
ru: Добавьте доверенное лицо для безопасности.

# relationLabel
source: Relation
de: Beziehung
es: Relación
ru: Степень родства

# emergencyRegisteredPerson
source: Registered contact
de: Gespeicherter Kontakt
es: Contacto registrado
ru: Сохранённый контакт

# identitySectionTitle
source: ID / Passport
de: Ausweis / Reisepass
es: ID / Pasaporte
ru: ID / Паспорт

# identitySectionSubtitle
source: Upload the document that will be shown during deliveries.
de: Lade das Dokument hoch, das bei Übergaben gezeigt wird.
es: Carga el documento que mostrarás durante las entregas.
ru: Загрузите документ, который покажете при доставке.

# identityPreviewHint
source: Document preview will appear here
de: Hier erscheint die Dokumentvorschau
es: La vista previa del documento aparecerá aquí
ru: Здесь появится предварительный просмотр документа

# identityDocIdCard
source: ID Card
de: Ausweis
es: Documento de identidad
ru: Удостоверение личности

# identityDocPassport
source: Passport
de: Reisepass
es: Pasaporte
ru: Паспорт

# identityUploaded
source: Uploaded document: {file}
de: Hochgeladenes Dokument: {file}
es: Documento cargado: {file}
ru: Загруженный документ: {file}

# identityMissing
source: No document uploaded yet. ID or passport photo is required for deliveries.
de: Noch kein Dokument hochgeladen. Für Übergaben ist ein Ausweis- oder Passfoto erforderlich.
es: Aún no se ha cargado un documento. Se requiere foto de ID o pasaporte para las entregas.
ru: Документ ещё не загружен. Для доставки требуется фото удостоверения или паспорта.

# identityTakePhoto
source: Capture from camera
de: Mit Kamera aufnehmen
es: Tomar con la cámara
ru: Снять на камеру

# identityPickFromGallery
source: Choose from gallery
de: Aus Galerie wählen
es: Elegir de la galería
ru: Выбрать из галереи

# identityDelete
source: Delete document
de: Dokument löschen
es: Eliminar documento
ru: Удалить документ

# identityPhotoSaved
source: {docType} photo saved ✅
de: {docType}-Foto gespeichert ✅
es: Foto de {docType} guardada ✅
ru: Фото {docType} сохранено ✅

# identityUploadFailed
source: Document upload failed: {details}
de: Dokument konnte nicht hochgeladen werden: {details}
es: No se pudo subir el documento: {details}
ru: Не удалось загрузить документ: {details}

# identityRemoved
source: Document removed.
de: Dokument entfernt.
es: Documento eliminado.
ru: Документ удалён.

# identityProofRequired
source: Upload an ID or passport photo before proceeding.
de: Lade vor dem Fortfahren ein Ausweis- oder Passfoto hoch.
es: Sube una foto de tu ID o pasaporte antes de continuar.
ru: Загрузите фото удостоверения или паспорта перед продолжением.

# profileDataMissing
source: Profile data could not be loaded.
de: Profildaten konnten nicht geladen werden.
es: No se pudieron cargar los datos del perfil.
ru: Не удалось загрузить данные профиля.

# profileLoadFailed
source: Profile could not be loaded: {details}
de: Profil konnte nicht geladen werden: {details}
es: No se pudo cargar el perfil: {details}
ru: Не удалось загрузить профиль: {details}

# profileUserMissing
source: User not found. Please sign in again.
de: Benutzer nicht gefunden. Bitte melde dich erneut an.
es: Usuario no encontrado. Inicia sesión nuevamente.
ru: Пользователь не найден. Пожалуйста, войдите снова.

# luggageLocationMissing
source: No location information available for this luggage.
de: Für dieses Gepäck sind keine Standortdaten vorhanden.
es: No hay información de ubicación para este equipaje.
ru: Для этого багажа нет данных о локации.

# luggageInfoSize
source: Size: {value}
de: Größe: {value}
es: Tamaño: {value}
ru: Размер: {value}

# luggageInfoWeight
source: Weight: {value} kg
de: Gewicht: {value} kg
es: Peso: {value} kg
ru: Вес: {value} кг

# noteLabel
source: Note: {note}
de: Notiz: {note}
es: Nota: {note}
ru: Заметка: {note}

# scheduledDropLabel
source: Planned drop: {date}
de: Geplante Abgabe: {date}
es: Entrega planificada: {date}
ru: Планируемая сдача: {date}

# scheduledPickupLabel
source: Planned pickup: {date}
de: Geplante Abholung: {date}
es: Recogida planificada: {date}
ru: Планируемое получение: {date}

# reservationCancelledLabel
source: This reservation has been cancelled.
de: Diese Reservierung wurde storniert.
es: Esta reserva ha sido cancelada.
ru: Это бронирование отменено.

# luggageShowQr
source: Show QR Code
de: QR-Code anzeigen
es: Mostrar código QR
ru: Показать QR-код

# luggageDropAction
source: I dropped the luggage
de: Gepäck abgegeben
es: Dejé el equipaje
ru: Я оставил багаж

# luggagePickupAction
source: Pick up luggage
de: Gepäck abholen
es: Recoger equipaje
ru: Забрать багаж

# luggageCancelAction
source: Cancel reservation
de: Reservierung stornieren
es: Cancelar reserva
ru: Отменить бронирование

# luggageOpenLocation
source: Open location
de: Standort öffnen
es: Abrir ubicación
ru: Открыть локацию

# createdAtLabel
source: Created: {date}
de: Erstellt: {date}
es: Creado: {date}
ru: Создано: {date}

# dropConfirmedAtLabel
source: Drop confirmed: {date}
de: Abgabe bestätigt: {date}
es: Entrega confirmada: {date}
ru: Сдача подтверждена: {date}

# pickupConfirmedAtLabel
source: Pickup confirmed: {date}
de: Abholung bestätigt: {date}
es: Recogida confirmada: {date}
ru: Получение подтверждено: {date}

# loginRequired
source: Please sign in first.
de: Bitte melde dich zuerst an.
es: Inicia sesión primero.
ru: Сначала войдите в систему.

# luggageCreated
source: New luggage created ✅
de: Neues Gepäck erstellt ✅
es: Nuevo equipaje creado ✅
ru: Создан новый багаж ✅

# dropConfirmedMessage
source: Drop confirmed ✅
de: Abgabe bestätigt ✅
es: Entrega confirmada ✅
ru: Сдача подтверждена ✅

# pickupConfirmedMessage
source: Pickup completed ✅
de: Abholung abgeschlossen ✅
es: Recogida completada ✅
ru: Получение завершено ✅

# operationFailed
source: Operation could not be completed.
de: Vorgang konnte nicht abgeschlossen werden.
es: No se pudo completar la operación.
ru: Операция не завершена.

# operationFailedWithDetails
source: Operation could not be completed: {details}
de: Vorgang konnte nicht abgeschlossen werden: {details}
es: La operación no se completó: {details}
ru: Операция не завершена: {details}

# reservationCancelledMessage
source: Reservation cancelled.
de: Reservierung storniert.
es: Reserva cancelada.
ru: Бронирование отменено.

# cancelFailed
source: Cancellation failed.
de: Stornierung fehlgeschlagen.
es: No se pudo cancelar.
ru: Отмена не выполнена.

# cancelFailedWithDetails
source: Cancellation failed: {details}
de: Stornierung fehlgeschlagen: {details}
es: La cancelación falló: {details}
ru: Не удалось отменить: {details}

# cancelReservationTitle
source: Cancel reservation
de: Reservierung stornieren
es: Cancelar reserva
ru: Отменить бронирование

# cancelReservationMessage
source: Are you sure you want to cancel the reservation for “{label}”?
de: Möchtest du die Reservierung für „{label}“ wirklich stornieren?
es: ¿Seguro que deseas cancelar la reserva de “{label}”?
ru: Вы уверены, что хотите отменить бронирование «{label}»?

# dialogDismiss
source: Cancel
de: Abbrechen
es: Cancelar
ru: Отмена

# dialogConfirmCancel
source: Cancel it
de: Stornieren
es: Cancelar
ru: Отменить

# dialogConfirm
source: Yes
de: Ja
es: Sí
ru: Да

# reservationTileTitle
source: Reservation {code}
de: Reservierung {code}
es: Reserva {code}
ru: Бронирование {code}

# reservationSlotSummary
source: {count} bags • {time}
de: {count} Gepäckstücke • {time}
es: {count} equipajes • {time}
ru: {count} багаж • {time}

# notificationsTooltip
source: Notifications
de: Benachrichtigungen
es: Notificaciones
ru: Уведомления

# notificationsClearTooltip
source: Clear
es: Limpiar

# notificationsEmptyTitle
source: No notifications yet
es: No hay notificaciones aún

# notificationsEmptySubtitle
source: Your notifications will appear here once you sign in or start using the app.
es: Tus notificaciones aparecerán aquí cuando inicies sesión o empieces a usar la app.

# notificationTypeSuccess
source: Success
es: Éxito

# notificationTypeWarning
source: Warning
es: Advertencia

# notificationTypeInfo
source: Info
es: Información

# notificationsRelativeNow
source: Just now
es: Justo ahora

# notificationsRelativeSeconds
source: {count}s ago
es: Hace {count} s

# notificationsRelativeMinutes
source: {count}m ago
es: Hace {count} min

# notificationsRelativeHours
source: {count}h ago
es: Hace {count} h

# notificationsRelativeDays
source: {count}d ago
es: Hace {count} d

# mapNoLocations
source: No locations found.
de: Keine Standorte gefunden.
es: No se encontraron ubicaciones.
ru: Локации не найдены.

# locationServiceDisabled
source: Location service is turned off.
de: Der Standortdienst ist deaktiviert.
es: El servicio de ubicación está desactivado.
ru: Служба геолокации отключена.

# locationPermissionPermanentlyDenied
source: Location permission permanently denied. Enable it from settings.
de: Standortberechtigung dauerhaft verweigert. Bitte in den Einstellungen aktivieren.
es: El permiso de ubicación se denegó permanentemente. Actívalo desde la configuración.
ru: Доступ к геолокации навсегда отклонён. Включите в настройках.

# locationFailedWithDetails
source: Location could not be obtained: {details}
de: Standort konnte nicht ermittelt werden: {details}
es: No se pudo obtener la ubicación: {details}
ru: Не удалось получить геолокацию: {details}

# locationNotFoundTitle
source: Location not found
de: Standort nicht gefunden
es: Ubicación no encontrada
ru: Локация не найдена

# locationNotFoundMessage
source: The selected location is no longer available.
de: Der ausgewählte Standort ist nicht mehr verfügbar.
es: La ubicación seleccionada ya no está disponible.
ru: Выбранная локация больше недоступна.

# permissionManageButton
source: Manage
de: Verwalten
es: Gestionar
ru: Настроить

# settingsPermissionsTitle
source: Permissions
de: Berechtigungen
es: Permisos
ru: Разрешения

# settingsPermissionsSubtitle
source: Control camera, location, and notification access.
de: Verwalte Kamera-, Standort- und Benachrichtigungszugriffe.
es: Administra los permisos de cámara, ubicación y notificaciones.
ru: Управляйте доступом к камере, геолокации и уведомлениям.

# privacySectionTitle
source: Privacy
de: Datenschutz
es: Privacidad
ru: Конфиденциальность

# privacySectionSubtitle
source: Adjust in-app notification preferences.
de: Passe die In-App-Benachrichtigungen an.
es: Ajusta las preferencias de notificaciones en la app.
ru: Настройте параметры уведомлений в приложении.

# remindersSectionTitle
source: Reminders
de: Erinnerungen
es: Recordatorios
ru: Напоминания

# remindersSectionSubtitle
source: Choose alerts for drop-off and pickup.
de: Wähle Warnungen für Abgabe und Abholung.
es: Elige alertas para entrega y recogida.
ru: Выберите оповещения о сдаче и получении.

# pushRemindersLabel
source: Push notifications
de: Push-Benachrichtigungen
es: Notificaciones push
ru: Push-уведомления

# emailRemindersLabel
source: Email reminders
de: E-Mail-Erinnerungen
es: Recordatorios por correo
ru: Email-напоминания

# languageSectionTitle
source: Language
de: Sprache
es: Idioma
ru: Язык

# languageSectionSubtitle
source: Choose the language of the app.
de: Wähle die Sprache der App.
es: Elige el idioma de la app.
ru: Выберите язык приложения.

# languageNameTr
source: Turkish
de: Türkisch
es: Turco
ru: Турецкий

# languageNameEn
source: English
de: Englisch
es: Inglés
ru: Английский

# languageNameDe
source: German
de: Deutsch
es: Alemán
ru: Немецкий

# languageNameEs
source: Spanish
de: Spanisch
es: Español
ru: Испанский

# languageNameRu
source: Russian
de: Russisch
es: Ruso
ru: Русский

# languageChangedTo
source: Language changed to {language} ✅
de: Sprache wurde zu {language} geändert ✅
es: Idioma cambiado a {language} ✅
ru: Язык изменён на {language} ✅

# upcomingReservationsTitle
source: Upcoming Reservations
de: Bevorstehende Reservierungen
es: Reservas próximas
ru: Ближайшие бронирования

# upcomingReservationsSubtitle
source: Names stay hidden; only codes and capacity are shown.
de: Namen bleiben verborgen; nur Codes und Auslastung werden angezeigt.
es: Los nombres se mantienen ocultos; solo se muestran los códigos y la capacidad.
ru: Имена скрыты; показаны только коды и заполняемость.

# upcomingReservationsEmpty
source: No reservations are planned for this location.
de: Für diesen Standort sind keine Reservierungen geplant.
es: No hay reservas planificadas para esta ubicación.
ru: Для этой локации бронирования не запланированы.

# continueSectionTitle
source: Continue
de: Fortfahren
es: Continuar
ru: Продолжить

# continueSectionSubtitle
source: If you already have an account, sign in; otherwise register quickly.
de: Wenn du bereits ein Konto hast, melde dich an – ansonsten registriere dich schnell.
es: Si ya eres miembro inicia sesión; de lo contrario regístrate rápido.
ru: Если вы уже зарегистрированы — войдите, иначе быстро создайте аккаунт.

# accountSectionSubtitle
source: Change your password or sign out.
de: Ändere dein Passwort oder melde dich ab.
es: Cambia tu contraseña o cierra sesión.
ru: Смените пароль или выйдите.

# logoutDialogTitle
source: Sign out
de: Abmelden
es: Cerrar sesión
ru: Выход из аккаунта

# logoutDialogMessage
source: Do you want to sign out of the account?
de: Möchtest du dich abmelden?
es: ¿Quieres cerrar sesión?
ru: Выйти из аккаунта?

# userIdMissing
source: Not signed in: userId not found.
de: Nicht angemeldet: userId wurde nicht gefunden.
es: No has iniciado sesión: no se encontró userId.
ru: Вход не выполнен: userId не найден.

# userIdReadFailed
source: Could not read userId: {details}
de: userId konnte nicht gelesen werden: {details}
es: No se pudo leer el userId: {details}
ru: Не удалось прочитать userId: {details}

# mapsMissingApiKey
source: Google Maps API key is not configured.
de: Google-Maps-API-Schlüssel ist nicht konfiguriert.
es: La clave de Google Maps no está configurada.
ru: Ключ Google Maps не настроен.

# routeFetchFailedWithDetails
source: Route could not be fetched: {details}
de: Route konnte nicht geladen werden: {details}
es: No se pudo obtener la ruta: {details}
ru: Не удалось получить маршрут: {details}

# routeNotFound
source: No route found.
de: Keine Route gefunden.
es: No se encontró ruta.
ru: Маршрут не найден.

# routeDataMissing
source: Route data could not be obtained.
de: Routendaten konnten nicht abgerufen werden.
es: No se pudieron obtener los datos de la ruta.
ru: Не удалось получить данные маршрута.

# directionsApiError
source: Google Directions API failed: {status}. Ensure the key has Directions API access.
de: Google Directions meldete einen Fehler: {status}. Stelle sicher, dass der Schlüssel Zugriff auf Directions hat.
es: La API de Google Directions falló: {status}. Verifica que la clave tenga acceso a Directions.
ru: Google Directions вернул ошибку: {status}. Проверьте доступ ключа к Directions.

# reservationEmptyState
source: No scheduled reservations.
de: Keine geplanten Reservierungen.
es: No hay reservas programadas.
ru: Нет запланированных бронирований.

# availableSlotsLabel
source: Free {available}/{total}
de: Frei {available}/{total}
es: Libre {available}/{total}
ru: Свободно {available}/{total}

# qrDropTitle
source: Confirm drop with QR
de: Abgabe mit QR bestätigen
es: Confirmar entrega con QR
ru: Подтвердить сдачу по QR

# qrPickupTitle
source: Confirm pickup with QR
de: Abholung mit QR bestätigen
es: Confirmar recogida con QR
ru: Подтвердить выдачу по QR

# qrManualEntryHint
source: If you cannot scan the QR code, enter it manually.
de: Wenn du den QR-Code nicht scannen kannst, gib ihn manuell ein.
es: Si no puedes escanear el QR, introdúcelo manualmente.
ru: Если не удаётся сканировать, введите код вручную.

# qrVerifyButton
source: Verify
de: Prüfen
es: Verificar
ru: Проверить

# qrMismatchMessage
source: QR code does not match. Try again.
de: Der QR-Code stimmt nicht überein. Bitte erneut versuchen.
es: El código QR no coincide. Inténtalo de nuevo.
ru: QR-код не совпал. Попробуйте снова.

# qrCopied
source: QR code copied.
de: QR-Code kopiert.
es: Código QR copiado.
ru: QR-код скопирован.

# qrTextCopied
source: Text copied.
de: Text kopiert.
es: Texto copiado.
ru: Текст скопирован.

# qrCopyCode
source: Copy code
de: Code kopieren
es: Copiar código
ru: Скопировать код

# qrCopyPrintable
source: Copy printer-friendly text
de: Text für den Druck kopieren
es: Copiar texto para imprimir
ru: Скопировать текст для печати

# qrShareInstructions
source: Share this code with staff to print the sticker. Customers must scan the same code during drop-off and pickup.
de: Teile diesen Code mit dem Personal, um den Sticker zu drucken. Kund:innen müssen denselben Code bei Abgabe und Abholung scannen.
es: Comparte este código con el personal para imprimir la pegatina. El cliente debe escanearlo al dejar y recoger.
ru: Поделитесь этим кодом с персоналом, чтобы распечатать стикер. Клиент должен сканировать его при сдаче и выдаче.

# qrDuplicateWarning
source: This QR code is already in use. We generated a new one—please try again.
de: Dieser QR-Code wird bereits verwendet. Wir haben einen neuen erzeugt – bitte erneut versuchen.
es: Este código QR ya está en uso. Generamos uno nuevo, inténtalo otra vez.
ru: Этот QR-код уже используется. Мы создали новый — попробуйте ещё раз.

# qrScanTip
source: Ensure the code is sharp inside the frame.
de: Achte darauf, dass der Code scharf innerhalb des Rahmens sichtbar ist.
es: Asegúrate de que el código esté nítido dentro del marco.
ru: Убедитесь, что код хорошо виден в рамке.

# locationFetching
source: Fetching location...
de: Standort wird ermittelt...
es: Obteniendo ubicación...
ru: Получаем местоположение...

# refreshNearbyButton
source: Update nearby locations
de: Nahe Standorte aktualisieren
es: Actualizar ubicaciones cercanas
ru: Обновить ближайшие точки

# nearbyLocationsTitle
source: Nearby locations
de: Nahe Standorte
es: Ubicaciones cercanas
ru: Ближайшие точки

# landingIntro
source: Choose where to drop your luggage. Tap a point on the map to see its occupancy and open reservation details.
de: Wähle, wo du dein Gepäck abgeben möchtest. Tippe einen Punkt auf der Karte an, um Auslastung und Reservierungsdetails zu sehen.
es: Elige dónde dejar tu equipaje. Toca un punto en el mapa para ver su ocupación y abrir los detalles de la reserva.
ru: Выбери, где оставить багаж. Нажми точку на карте, чтобы увидеть заполненность и открыть детали бронирования.

# occupancyLabel
source: Occupancy: {current}/{max}
de: Auslastung: {current}/{max}
es: Ocupación: {current}/{max}
ru: Заполненность: {current}/{max}

# locationOpenLabel
source: Open
de: Geöffnet
es: Abierto
ru: Открыто

# locationClosedLabel
source: Closed
de: Geschlossen
es: Cerrado
ru: Закрыто

# openingHoursTitle
source: Opening Hours
de: Öffnungszeiten
es: Horario de apertura
ru: Часы работы

# openingHoursSubtitle
source: Weekly schedule
de: Wöchentlicher Plan
es: Horario semanal
ru: Еженедельный график

# openingHoursAlwaysOpen
source: Open 24/7
de: Rund um die Uhr geöffnet
es: Abierto 24/7
ru: Открыто 24/7

# openingHoursClosed
source: Closed
de: Geschlossen
es: Cerrado
ru: Закрыто

# locationFullWarning
source: Selected location is full.
de: Der ausgewählte Standort ist voll.
es: La ubicación seleccionada está llena.
ru: Выбранная локация заполнена.

# locationClosedWarning
source: Selected location is currently closed.
de: Der ausgewählte Standort ist derzeit geschlossen.
es: La ubicación seleccionada está cerrada en este momento.
ru: Выбранная локация сейчас закрыта.

# locationInactiveWarning
source: Selected location is inactive.
de: Der ausgewählte Standort ist inaktiv.
es: La ubicación seleccionada está inactiva.
ru: Выбранная локация неактивна.

# protectionLevelTitle
source: Protection Level
de: Schutzstufe
es: Nivel de protección
ru: Уровень защиты

# protectionStandard
source: Standard
es: Estándar
ru: Стандарт

# protectionPremium
source: Premium protection
de: Premium-Schutz
es: Protección premium
ru: Премиум-защита

# paymentMethodTitle
source: Payment Method
de: Zahlungsmethode
es: Método de pago
ru: Способ оплаты

# paymentMethodCard
source: Card
de: Karte
es: Tarjeta
ru: Карта

# paymentMethodInstallment
source: Installment
de: Ratenzahlung
es: Cuotas
ru: Рассрочка

# paymentMethodPayAtHotel
source: Pay at hotel
de: Im Hotel zahlen
es: Pagar en el hotel
ru: Оплата в отеле
