Repository: Aparialtech/Kyradi-app
Catalog: lib/l10n/app_*.arb
Languages: de, es, ru

# registerKvkkDocumentBody
source: Personal Data Protection and Processing Notice This notice explains which personal data are processed within the KYRADI platform and for what purposes, in accordance with the Turkish Personal Data Protection Law No. 6698 ("KVKK"). Types of Personal Data Processed Within KYRADI, the following personal data groups are processed: Customer data: Name and surname, phone, QR code token, reservation and locker information, payment amount and transaction number Staff data: Name and surname, email, user role, IP, transaction logs, session information Technical data: Audit log records, browser/device information, error reports Purposes of Processing Personal data are processed for providing the reservation flow, generating and verifying QR codes, managing payment intents, operating baggage drop-off and pickup processes, ensuring system security and detecting abuse, fulfilling legal retention obligations, and reporting and platform improvements. Legal Bases Personal data are processed based on KVKK Article 5/2-c (establishment and performance of a contract), Article 5/2-f (legitimate interest), Article 5/2-ç (legal obligations), and explicit consent where required. Recipients of Data Transfers Personal data may be transferred to payment service providers such as Stripe and Iyzico, cloud providers such as AWS, Google Cloud, Render, and Vercel for infrastructure and hosting, relevant public authorities in mandatory cases, and legal or financial advisors. Retention Periods Personal data are retained for 10 years for reservation and payment records, 2 years for audit logs, and 1 year after account closure for user accounts; QR code tokens are retained for 1–24 hours. Security Measures KYRADI applies technical and administrative security measures such as tenant-based data isolation, password hashing, JWT-based security, role-based access control, rate limiting and attack prevention, and audit logs for critical actions. Data Subject Rights Under Article 11 of KVKK, data subjects have the rights to learn whether their personal data are processed, request deletion or correction, object to processing, and claim compensation in case of damage. Applications can be sent to kvkk@kyradi.com.
de: Information zur Verarbeitung personenbezogener Daten Dieser Text erläutert, welche personenbezogenen Daten im Rahmen der KYRADI-Plattform nach dem türkischen Datenschutzgesetz Nr. 6698 ("KVKK") in welchem Umfang und zu welchen Zwecken verarbeitet werden. Arten der verarbeiteten personenbezogenen Daten Im Rahmen von KYRADI werden folgende Datenkategorien verarbeitet: Kundendaten: Vor- und Nachname, Telefon, QR-Code-Token, Reservierungs- und Schließfachinformationen, Zahlungsbetrag und Transaktionsnummer Mitarbeiterdaten: Vor- und Nachname, E-Mail, Benutzerrolle, IP, Transaktionslogs, Sitzungsinformationen Technische Daten: Audit-Log-Einträge, Browser-/Geräteinformationen, Fehlerberichte Zwecke der Verarbeitung Personenbezogene Daten werden verarbeitet, um den Reservierungsablauf bereitzustellen, QR-Codes zu erzeugen und zu verifizieren, Zahlungs-Intents zu verwalten, die Gepäckabgabe und -abholung durchzuführen, die Systemsicherheit zu gewährleisten und Missbrauch zu erkennen, gesetzliche Aufbewahrungspflichten zu erfüllen sowie für Reporting und Plattformverbesserungen. Rechtsgrundlagen Personenbezogene Daten werden gemäß KVKK Art. 5/2-c (Vertragsschluss und -erfüllung), Art. 5/2-f (berechtigtes Interesse), Art. 5/2-ç (gesetzliche Pflichten) sowie auf Basis ausdrücklicher Einwilligung verarbeitet, soweit erforderlich. Empfänger der Datenübermittlung Personenbezogene Daten können an Zahlungsdienstleister wie Stripe und Iyzico, Cloud-Anbieter wie AWS, Google Cloud, Render und Vercel, zuständige Behörden in zwingenden Fällen sowie an rechtliche oder finanzielle Berater übermittelt werden. Aufbewahrungsfristen Personenbezogene Daten werden für Reservierungs- und Zahlungsdaten 10 Jahre, für Audit-Logs 2 Jahre und für Benutzerkonten 1 Jahr nach Kontoschließung aufbewahrt; QR-Code-Tokens werden 1–24 Stunden gespeichert. Sicherheitsmaßnahmen KYRADI setzt technische und organisatorische Sicherheitsmaßnahmen wie mandantenbasierte Datenisolierung, Passwort-Hashing, JWT-basierte Sicherheit, rollenbasierte Zugriffskontrolle, Rate Limiting und Angriffsprävention sowie Audit-Logs für kritische Vorgänge ein. Rechte der betroffenen Person Gemäß Art. 11 der KVKK haben betroffene Personen das Recht, Auskunft über die Verarbeitung zu erhalten, Löschung oder Berichtigung zu verlangen, der Verarbeitung zu widersprechen und bei Schadenersatzansprüchen geltend zu machen. Anträge können an kvkk@kyradi.com gesendet werden.
es: Aviso de Protección y Tratamiento de Datos Personales Este texto explica el alcance y los fines del tratamiento de los datos personales procesados dentro de la plataforma KYRADI, de conformidad con la Ley turca de Protección de Datos Personales N.º 6698 ("KVKK"). Tipos de datos personales tratados En KYRADI se tratan los siguientes grupos de datos: Datos del cliente: Nombre y apellidos, teléfono, token de QR, información de reserva y taquilla, importe del pago y número de transacción Datos del personal: Nombre y apellidos, correo electrónico, rol de usuario, IP, registros de transacciones, información de sesión Datos técnicos: Registros de auditoría, información del navegador/dispositivo, informes de errores Finalidades del tratamiento Los datos personales se tratan para proporcionar el flujo de reservas, generar y verificar códigos QR, gestionar los intentos de pago, operar los procesos de entrega y recogida de equipaje, garantizar la seguridad del sistema y detectar abusos, cumplir obligaciones legales de conservación, y para informes y mejoras de la plataforma. Base legal Los datos personales se tratan conforme al Art. 5/2-c de la KVKK (celebración y ejecución del contrato), Art. 5/2-f (interés legítimo), Art. 5/2-ç (obligaciones legales) y consentimiento explícito cuando sea necesario. Destinatarios de las transferencias Los datos personales pueden transferirse a proveedores de servicios de pago como Stripe e Iyzico, proveedores de nube como AWS, Google Cloud, Render y Vercel para infraestructura y alojamiento, autoridades públicas en casos obligatorios y asesores legales o financieros. Plazos de conservación Los datos personales se conservan durante 10 años para registros de reservas y pagos, 2 años para registros de auditoría y 1 año después del cierre de la cuenta para cuentas de usuario; los tokens de QR se conservan de 1 a 24 horas. Medidas de seguridad KYRADI aplica medidas técnicas y administrativas como aislamiento de datos por inquilino, hash de contraseñas, seguridad basada en JWT, control de acceso por roles, limitación de tasa y prevención de ataques, y registros de auditoría para acciones críticas. Derechos del interesado Según el Artículo 11 de la KVKK, los interesados tienen derecho a saber si sus datos personales se procesan, solicitar la eliminación o corrección, oponerse al tratamiento y reclamar compensación en caso de daño. Las solicitudes pueden enviarse a kvkk@kyradi.com.
ru: Уведомление о защите и обработке персональных данных Этот текст подготовлен, чтобы объяснить, в каком объеме и для каких целей обрабатываются персональные данные в рамках платформы KYRADI в соответствии с Законом Турции о защите персональных данных № 6698 ("KVKK"). Виды обрабатываемых персональных данных В рамках KYRADI обрабатываются следующие категории данных: Данные клиента: Имя и фамилия, телефон, QR-токен, информация о бронировании и ячейке, сумма платежа и номер транзакции Данные персонала: Имя и фамилия, e-mail, роль пользователя, IP, журналы операций, информация о сессии Технические данные: Записи audit log, информация о браузере/устройстве, отчеты об ошибках Цели обработки Персональные данные обрабатываются для обеспечения процесса бронирования, генерации и проверки QR-кодов, управления платежными намерениями, выполнения процессов сдачи и получения багажа, обеспечения безопасности системы и выявления злоупотреблений, выполнения обязательных сроков хранения, а также для отчетности и улучшения платформы. Правовые основания Персональные данные обрабатываются на основании ст. 5/2-c KVKK (заключение и исполнение договора), ст. 5/2-f (законный интерес), ст. 5/2-ç (законные обязанности), а также на основании явного согласия в требуемых случаях. Получатели передачи данных Персональные данные могут передаваться платежным сервисам, таким как Stripe и Iyzico, облачным провайдерам, таким как AWS, Google Cloud, Render и Vercel, государственным органам в обязательных случаях, а также юридическим или финансовым консультантам. Сроки хранения Персональные данные хранятся 10 лет для записей бронирований и платежей, 2 года для audit log, и 1 год после закрытия аккаунта для учетных записей пользователей; QR-токены хранятся 1–24 часа. Меры безопасности KYRADI применяет технические и организационные меры безопасности, такие как изоляция данных по арендаторам, хэширование паролей, безопасность на базе JWT, контроль доступа по ролям, ограничение скорости и предотвращение атак, а также audit log для критических операций. Права субъекта данных Согласно ст. 11 KVKK, субъекты данных имеют право узнать, обрабатываются ли их персональные данные, запросить удаление или исправление, возразить против обработки и требовать компенсацию в случае ущерба. Обращения можно направлять на kvkk@kyradi.com.

# registerRestrictedDocumentBody
source: This document summarizes items that Aparial and general carriers do not accept for transport. For safety, legal regulations, and operational risk reasons, the items listed below are not accepted for transport: Dangerous and Risky Items - Explosives (dynamite, fireworks, grenades, etc.) - Flammable and combustible materials (gasoline, thinner, paint, solvents, etc.) - Pressurized gases (propane, butane, oxygen cylinders, etc.) - Toxic, poisonous, or corrosive chemicals (acid, base, bleach, etc.) - Radioactive materials - Flammable liquids or solvents containing hazardous chemicals - Any material or device that poses an explosion or fire risk Weapons and Hazardous Equipment - Weapons, ammunition, and similar firearms - Sharp or piercing tools (daggers, long knives, sharp metal tools, etc.) Devices and Pressurized Products - Devices containing gas or fuel (fuel-filled camping stoves, etc.) - Pressurized aerosol cans (sprays containing hazardous gas) - High-capacity or spare lithium batteries Items that Cause Disturbance or Safety Risk - Strong-smelling, smoke-emitting, or disturbing substances Valuables - Jewelry (gold, precious stones, etc.) are not accepted for transport. - Cash (regardless of amount) is not accepted for transport. Note: Some items may be transported with specific permits, quantities, or safety measures. However, in general, such items are rejected by both Aparial and other carriers.
de: Dieses Dokument fasst Gegenstände zusammen, die Aparial und allgemeine Transportunternehmen nicht zur Beförderung annehmen. Aus Sicherheits-, gesetzlichen und betrieblichen Risikogründen werden die folgenden Gegenstände nicht angenommen: Gefährliche und riskante Gegenstände - Explosivstoffe (Dynamit, Feuerwerk, Handgranaten usw.) - Entzündliche und brennbare Stoffe (Benzin, Verdünner, Farbe, Lösungsmittel usw.) - Druckgase (Propan, Butan, Sauerstoffflaschen usw.) - Giftige oder ätzende Chemikalien (Säure, Lauge, Bleichmittel usw.) - Radioaktive Stoffe - Entzündliche Flüssigkeiten oder Lösungsmittel mit gefährlichen Chemikalien - Jeglicher Stoff oder jedes Gerät mit Explosions- oder Brandrisiko Waffen und gefährliche Ausrüstung - Waffen, Munition und ähnliche Schusswaffen - Schneid- oder Stichwerkzeuge (Dolche, lange Messer, spitze Metallwerkzeuge usw.) Geräte und Druckprodukte - Geräte mit Gas oder Treibstoff (Campingkocher mit Brennstoff usw.) - Druckaerosoldosen (Sprays mit gefährlichem Gas) - Hochkapazitäts- oder Ersatz-Lithiumbatterien Störende oder sicherheitsrelevante Gegenstände - Stark riechende, rauchende oder störende Stoffe Wertsachen - Schmuck (Gold, Edelsteine usw.) wird nicht angenommen. - Bargeld (unabhängig von der Höhe) wird nicht angenommen. Hinweis: Einige Gegenstände können mit bestimmten Genehmigungen, Mengen oder Sicherheitsmaßnahmen transportiert werden. Im Allgemeinen werden solche Gegenstände jedoch sowohl von Aparial als auch von anderen Transportunternehmen abgelehnt.
es: Este documento resume los artículos que Aparial y las empresas de transporte generales no aceptan. Por razones de seguridad, normativas legales y riesgos operativos, los siguientes artículos no se aceptan para transporte: Materiales peligrosos y de riesgo - Explosivos (dinamita, fuegos artificiales, granadas, etc.) - Materiales inflamables y combustibles (gasolina, diluyente, pintura, disolventes, etc.) - Gases presurizados (propano, butano, cilindros de oxígeno, etc.) - Sustancias tóxicas, venenosas o corrosivas (ácido, base, lejía, etc.) - Materiales radiactivos - Líquidos inflamables o disolventes con químicos peligrosos - Cualquier material o dispositivo que suponga riesgo de explosión o incendio Armas y equipo peligroso - Armas, munición y armas de fuego similares - Herramientas cortantes o punzantes (dagas, cuchillos largos, herramientas metálicas puntiagudas, etc.) Dispositivos y productos presurizados - Dispositivos con gas o combustible (hornillos de camping con combustible, etc.) - Aerosoles presurizados (sprays con gas peligroso) - Baterías de litio de alta capacidad o de repuesto Sustancias que causan molestias o riesgo de seguridad - Sustancias de olor fuerte, que emiten humo o que molestan Objetos de valor - Joyas (oro, piedras preciosas, etc.) no se aceptan para transporte. - Dinero en efectivo (independientemente del importe) no se acepta para transporte. Nota: Algunos artículos pueden transportarse con permisos, cantidades o medidas de seguridad específicas. Sin embargo, en general, estos artículos son rechazados tanto por Aparial como por otros transportistas.
ru: Этот документ обобщает предметы, которые Aparial и общие транспортные компании не принимают к перевозке. По причинам безопасности, правового регулирования и операционных рисков перечисленные ниже предметы не принимаются: Опасные и рискованные предметы - Взрывчатые вещества (динамит, фейерверки, гранаты и т.д.) - Легковоспламеняющиеся вещества (бензин, растворитель, краска и т.д.) - Сжатые газы (пропан, бутан, кислородные баллоны и т.д.) - Токсичные, ядовитые или едкие химикаты (кислота, щелочь, отбеливатель и т.д.) - Радиоактивные материалы - Горючие жидкости или растворители с опасными химикатами - Любое вещество или устройство, представляющее риск взрыва или пожара Оружие и опасное оборудование - Оружие, боеприпасы и аналогичное огнестрельное - Колюще-режущие предметы (кинжалы, длинные ножи, острые металлические инструменты и т.д.) Устройства и продукция под давлением - Устройства с газом или топливом (туристические горелки с топливом и т.д.) - Аэрозольные баллоны под давлением (спреи с опасным газом) - Литиевые аккумуляторы большой емкости или запасные Предметы, вызывающие дискомфорт или риск - Сильно пахнущие, дымящие или раздражающие вещества Ценности - Ювелирные изделия (золото, драгоценные камни и т.д.) не принимаются. - Наличные деньги (независимо от суммы) не принимаются. Примечание: Некоторые предметы могут перевозиться при наличии разрешений, в определенных количествах или при соблюдении мер безопасности. Однако в целом такие предметы отклоняются как Aparial, так и другими перевозчиками.

# registerSuccessMessage
source: Registration successful ✅ Verification email sent.
de: Registrierung erfolgreich ✅ Bestätigungs-E-Mail gesendet.
es: Registro exitoso ✅ Se envió el correo de verificación.
ru: Регистрация успешна ✅ Письмо подтверждения отправлено.

# registerEmailExistsMessage
source: This email is already registered ❌
de: Diese E-Mail ist bereits registriert ❌
es: Este correo ya está registrado ❌
ru: Этот e-mail уже зарегистрирован ❌

# registerGenericErrorMessage
source: Registration failed ❌
de: Registrierung fehlgeschlagen ❌
es: El registro falló ❌
ru: Регистрация не удалась ❌

# validationRequired
source: Required
de: Pflichtfeld
es: Obligatorio
ru: Обязательно

# validationPasswordNeedsLetter
source: Include at least one letter
de: Mindestens einen Buchstaben eingeben
es: Incluye al menos una letra
ru: Нужна минимум одна буква

# validationPasswordNeedsNumber
source: Include at least one number
de: Mindestens eine Zahl eingeben
es: Incluye al menos un número
ru: Нужна минимум одна цифра

# validationPasswordRepeatRequired
source: Repeat your password
de: Passwort erneut eingeben
es: Repite tu contraseña
ru: Повторите пароль

# validationNationalIdRequired
source: National ID is required
de: Personalausweisnummer erforderlich
es: El número de identificación es obligatorio
ru: Требуется номер удостоверения

# validationNationalIdLength
source: ID must be 11 digits
de: Die ID muss 11 Ziffern haben
es: El ID debe tener 11 dígitos
ru: Номер должен содержать 11 цифр

# validationNationalIdChecksumTen
source: ID is invalid (10th digit)
de: ID ungültig (10. Stelle)
es: ID no válido (10.º dígito)
ru: Неверный номер (10-я цифра)

# validationNationalIdChecksumEleven
source: ID is invalid (11th digit)
de: ID ungültig (11. Stelle)
es: ID no válido (11.º dígito)
ru: Неверный номер (11-я цифра)

# validationNationalIdInvalid
source: ID is invalid
de: ID ungültig
es: ID no válido
ru: Неверный номер

# validationPhoneRequired
source: Phone number is required
de: Telefonnummer ist erforderlich
es: El teléfono es obligatorio
ru: Нужен номер телефона

# validationPhoneFormat
source: Format: +90 5xx xxx xx xx
es: Formato: +90 5xx xxx xx xx
ru: Формат: +90 5xx xxx xx xx

# validationBirthDateRequired
source: Select a birth date
de: Geburtsdatum auswählen
es: Selecciona una fecha de nacimiento
ru: Выберите дату рождения

# validationAgeRequirement
source: You must be older than 18
de: Du musst älter als 18 sein
es: Debes tener más de 18 años
ru: Вам должно быть больше 18 лет

# formNotSelected
source: Not selected
de: Nicht ausgewählt
es: Sin seleccionar
ru: Не выбрано

# forgotTitle
source: Forgot password
de: Passwort vergessen
es: Olvidé mi contraseña
ru: Забыли пароль

# forgotIntro
source: Let's send a code to your registered email to reset your password.
de: Wir senden einen Code an deine registrierte E-Mail, um dein Passwort zurückzusetzen.
es: Enviemos un código a tu correo registrado para restablecer tu contraseña.
ru: Отправим код на вашу почту для сброса пароля.

# forgotEmailSectionTitle
source: Email verification
de: E-Mail-Bestätigung
es: Verificación de correo
ru: Подтверждение e-mail

# forgotEmailSectionSubtitle
source: A one-time code will be sent to your registered address.
de: An deine registrierte Adresse wird ein Einmalcode gesendet.
es: Se enviará un código de un solo uso a tu dirección registrada.
ru: На зарегистрированный адрес придёт одноразовый код.

# emailAddressLabel
source: Email address
de: E-Mail-Adresse
es: Dirección de correo
ru: Адрес e-mail

# forgotSendButton
source: Send code
de: Code senden
es: Enviar código
ru: Отправить код

# forgotResendCountdown
source: Send again ({seconds}s)
de: Erneut senden ({seconds}s)
es: Enviar de nuevo ({seconds}s)
ru: Отправить снова ({seconds} с)

# forgotAlreadyHaveCode
source: I already have a code
de: Ich habe bereits einen Code
es: Ya tengo un código
ru: У меня уже есть код

# forgotNeedValidEmail
source: Please enter a valid email first 💌
de: Bitte gib zuerst eine gültige E-Mail ein 💌
es: Ingresa primero un correo válido 💌
ru: Сначала введите корректный e-mail 💌

# forgotCodeSent
source: Code sent 📩
de: Code gesendet 📩
es: Código enviado 📩
ru: Код отправлен 📩

# forgotEmailNotFound
source: This email is not registered ❌
de: Diese E-Mail ist nicht registriert ❌
es: Este correo no está registrado ❌
ru: Этот e-mail не зарегистрирован ❌

# forgotTooManyAttempts
source: Too many attempts, please try again in 1 minute ⚠️
de: Zu viele Versuche, bitte in 1 Minute erneut versuchen ⚠️
es: Demasiados intentos, inténtalo de nuevo en 1 minuto ⚠️
ru: Слишком много попыток, повторите через минуту ⚠️

# forgotCodeFailed
source: Code could not be sent ❌
de: Code konnte nicht gesendet werden ❌
es: No se pudo enviar el código ❌
ru: Не удалось отправить код ❌

# resetTitle
source: Reset password
de: Passwort zurücksetzen
es: Restablecer contraseña
ru: Сброс пароля

# resetSubtitle
source: Enter the code sent to this email and create a new password.
de: Gib den an diese E-Mail gesendeten Code ein und erstelle ein neues Passwort.
es: Introduce el código enviado a este correo y crea una nueva contraseña.
ru: Введите код, отправленный на этот e-mail, и создайте новый пароль.

# verificationCodeLabel
source: Verification code
de: Bestätigungscode
es: Código de verificación
ru: Код подтверждения

# resetNewPasswordLabel
source: New password
de: Neues Passwort
es: Nueva contraseña
ru: Новый пароль

# resetConfirmPasswordLabel
source: New password (repeat)
de: Neues Passwort (wiederholen)
es: Nueva contraseña (repite)
ru: Новый пароль (повтор)

# resetSubmitButton
source: Reset password
de: Passwort zurücksetzen
es: Restablecer contraseña
ru: Сбросить пароль

source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
ru: Неизвестная ошибка

# verificationTitle
source: Email verification
de: E-Mail-Bestätigung
es: Verificación de correo
ru: Подтверждение e-mail

# verificationInstructions
source: Enter the 6-digit code sent to {email}.
de: Gib den 6-stelligen Code ein, der an {email} gesendet wurde.
es: Ingresa el código de 6 dígitos enviado a {email}.
ru: Введите 6-значный код, отправленный на {email}.

# verifyButtonLabel
source: Verify code
de: Code bestätigen
es: Verificar código
ru: Подтвердить код

# verificationResendButton
source: Send code again
de: Code erneut senden
es: Enviar código otra vez
ru: Отправить код снова

# verificationCountdownLabel
source: Send again in {seconds}s
de: In {seconds}s erneut senden
es: Enviar de nuevo en {seconds}s
ru: Отправить снова через {seconds} с

# verificationResentMessage
source: Code sent again
de: Code erneut gesendet
es: Código enviado de nuevo
ru: Код отправлен повторно

# verificationSendErrorMessage
source: Sending failed
de: Senden fehlgeschlagen
es: Error al enviar
ru: Ошибка отправки

# verificationMissingEmailMessage
source: Email could not be retrieved
de: E-Mail konnte nicht abgerufen werden
es: No se pudo obtener el correo
ru: Не удалось получить e-mail

# verificationSuccessMessage
source: Account verified ✅
de: Konto verifiziert ✅
es: Cuenta verificada ✅
ru: Аккаунт подтверждён ✅

# verificationErrorMessage
source: Verification error
de: Verifizierungsfehler
es: Error de verificación
ru: Ошибка подтверждения

# verificationCodeInvalidMessage
source: Code must be 6 digits
de: Der Code muss 6 Stellen haben
es: El código debe tener 6 dígitos
ru: Код должен состоять из 6 цифр

# validationVerificationCodeRequired
source: Code is required
de: Code ist erforderlich
es: El código es obligatorio
ru: Код обязателен

# validationVerificationCodeLength
source: Enter a 6-digit code
de: 6-stelligen Code eingeben
es: Introduce un código de 6 dígitos
ru: Введите 6-значный код

# dashboardGreeting
source: Hello, {name}
de: Hallo, {name}
es: Hola, {name}
ru: Привет, {name}

# dashboardSubtitle
source: Share your location and manage your luggage.
de: Teile deinen Standort und verwalte dein Gepäck.
es: Comparte tu ubicación y administra tu equipaje.
ru: Поделись местоположением и управляй багажом.

# travelerPlaceholder
source: Traveler
de: Reisender
es: Viajero
ru: Путешественник

# quickAddLuggage
source: Add Luggage
de: Gepäck hinzufügen
es: Agregar equipaje
ru: Добавить багаж

# quickTransit
source: Transit
de: ÖPNV
es: Transporte público
ru: Транспорт
