Repository: Aparialtech/Kyradi-app
Catalog: lib/l10n/app_*.arb
Languages: de, es, ru

# paymentHotelCommissionNote
source: A 5% hotel commission will be added.
de: Eine Hotelprovision von 5 % wird hinzugefügt.
es: Se añadirá una comisión del hotel del 5 %.
ru: Будет добавлена комиссия отеля 5 %.

# paymentStartAction
source: Start payment
de: Zahlung starten
es: Iniciar pago
ru: Начать оплату

# paymentRequiredBeforeDropMessage
source: Drop-off cannot be completed before payment.
de: Ohne Zahlung kann die Abgabe nicht abgeschlossen werden.
es: No se puede completar la entrega sin el pago.
ru: Сдача невозможна до завершения оплаты.

# paymentNotCompletedMessage
source: Payment must be completed before drop-off.
de: Die Zahlung muss vor der Abgabe abgeschlossen sein.
es: El pago debe completarse antes de la entrega.
ru: Оплату нужно завершить перед сдачей.

# paymentCompletedMessage
source: Payment completed. You can drop your luggage.
de: Zahlung abgeschlossen. Du kannst das Gepäck abgeben.
es: Pago completado. Puedes entregar tu equipaje.
ru: Оплата завершена. Можно сдать багаж.

# paymentPageTitle
source: Payment
de: Zahlung
es: Pago
ru: Оплата

# paymentPageSubtitle
source: Enter your card details to complete payment.
de: Gib deine Kartendaten ein, um die Zahlung abzuschließen.
es: Introduce los datos de tu tarjeta para completar el pago.
ru: Введите данные карты, чтобы завершить оплату.

# paymentCardNumberLabel
source: Card number
de: Kartennummer
es: Número de tarjeta
ru: Номер карты

# paymentCardNameLabel
source: Name on card
de: Name auf der Karte
es: Nombre en la tarjeta
ru: Имя на карте

# paymentExpiryLabel
source: Expiry
de: Gültig bis
es: Caducidad
ru: Срок действия

# paymentCompleteAction
source: Complete payment
de: Zahlung abschließen
es: Completar pago
ru: Завершить оплату

# paymentFormIncompleteMessage
source: Please complete all card details.
de: Bitte alle Kartendaten ausfüllen.
es: Completa todos los datos de la tarjeta.
ru: Заполните все данные карты.

# paymentFailedMessage
source: Payment could not be completed.
de: Zahlung konnte nicht abgeschlossen werden.
es: No se pudo completar el pago.
ru: Не удалось завершить оплату.

# paymentPayAtHotelTitle
source: Pay at hotel
de: Im Hotel zahlen
es: Pagar en el hotel
ru: Оплата в отеле

# paymentPayAtHotelBody
source: You can complete your payment at the selected location.
de: Du kannst die Zahlung am ausgewählten Standort abschließen.
es: Puedes completar el pago en la ubicación seleccionada.
ru: Вы можете завершить оплату в выбранной локации.

# installmentCountLabel
source: Installment count
de: Anzahl der Raten
es: Número de cuotas
ru: Количество платежей

# pricingEstimateTitle
source: Estimated Price
de: Preisvorschau
es: Precio estimado
ru: Предварительная стоимость

# pricingEstimateLoading
source: Calculating estimate...
de: Preis wird berechnet...
es: Calculando estimación...
ru: Расчёт стоимости...

# pricingBasePriceLabel
source: Base price
de: Basispreis
es: Precio base
ru: Базовая цена

# pricingPremiumFeeLabel
source: Premium protection
de: Premium-Schutz
es: Protección premium
ru: Премиум-защита

# pricingHotelCommissionLabel
source: Hotel commission
de: Hotelprovision
es: Comisión del hotel
ru: Комиссия отеля

# pricingInstallmentFeeLabel
source: Installment fee
de: Ratenaufschlag
es: Recargo por cuotas
ru: Наценка за рассрочку

# pricingEstimateDisclaimer
source: This is an estimate and may change based on actual drop-off time.
de: Dies ist eine Schätzung und kann sich je nach tatsächlicher Abgabezeit ändern.
es: Este precio es una estimación y puede variar según la hora real de entrega.
ru: Это оценка, итоговая сумма может измениться по фактическому времени сдачи.

# pricingEstimateUnavailable
source: Select drop and pickup times to see an estimate.
de: Wähle Abgabe- und Abholzeit, um eine Schätzung zu sehen.
es: Selecciona las horas de entrega y recogida para ver una estimación.
ru: Выберите время сдачи и получения, чтобы увидеть оценку.

# pickupPinSentMessage
source: Pickup PIN was sent to your email.
de: Die Abhol-PIN wurde an deine E-Mail gesendet.
es: El PIN de recogida se envió a tu correo.
ru: PIN для получения отправлен на вашу почту.

# pickupPinFailedMessage
source: PIN could not be sent. Please try again later.
de: PIN konnte nicht gesendet werden. Bitte später erneut versuchen.
es: No se pudo enviar el PIN. Inténtalo más tarde.
ru: Не удалось отправить PIN. Попробуйте позже.

# landingLocateSectionTitle
source: Find the closest points
de: Finde die nächsten Punkte
es: Encuentra los puntos más cercanos
ru: Найди ближайшие точки

# landingLocateSectionSubtitle
source: Share your location to list recommendations.
de: Teile deinen Standort, um Empfehlungen zu erhalten.
es: Comparte tu ubicación para mostrar recomendaciones.
ru: Поделись геолокацией, чтобы получить рекомендации.

# landingLocateButton
source: Find my location
de: Meinen Standort finden
es: Encontrar mi ubicación
ru: Найти мое местоположение

# landingLocatingButton
source: Fetching location...
de: Standort wird ermittelt...
es: Obteniendo ubicación...
ru: Получаем местоположение...

# landingNearestTitle
source: Closest points
de: Nächste Punkte
es: Puntos más cercanos
ru: Ближайшие точки

# landingNearestSubtitle
source: Recommended 3 spots based on your location
de: 3 Empfehlungen basierend auf deinem Standort
es: 3 lugares recomendados según tu ubicación
ru: 3 рекомендуемые места рядом с вами

# landingGoButton
source: Go
de: Los
es: Ir
ru: Маршрут

# landingDetailsButton
source: Details
es: Detalles
ru: Подробнее

# commonSelect
source: Select
de: Auswählen
es: Seleccionar
ru: Выбрать

# dropTimePending
source: Drop time not selected
de: Abgabezeit nicht gewählt
es: Hora de entrega no seleccionada
ru: Время сдачи не выбрано

# dropTimeLabel
source: Drop time: {time}
de: Abgabezeit: {time}
es: Hora de entrega: {time}
ru: Время сдачи: {time}

# pickupTimePending
source: Pickup time not selected
de: Abholzeit nicht gewählt
es: Hora de recogida no seleccionada
ru: Время выдачи не выбрано

# pickupTimeLabel
source: Pickup time: {time}
de: Abholzeit: {time}
es: Hora de recogida: {time}
ru: Время выдачи: {time}

# scheduleTimesRequired
source: Drop-off and pickup times are required.
de: Bitte Abgabe- und Abholzeit auswählen.
es: Debes elegir la hora de entrega y recogida.
ru: Нужно выбрать время сдачи и выдачи.

# notesHint
source: Lock, fragile, special instructions...
de: Schloss, zerbrechlich, besondere Hinweise...
es: Candado, frágil, instrucciones especiales...
ru: Замок, хрупкое, особые указания...

# luggageNameHint
source: Give the luggage a name (optional)
de: Gib dem Gepäck einen Namen (optional)
es: Ponle un nombre al equipaje (opcional)
ru: Дайте имя багажу (необязательно)

# luggageRegistrationNote
source: After saving, your staff can print the QR sticker. Customers must scan the code when dropping off and picking up.
de: Nach dem Speichern kann dein Team den QR-Sticker drucken. Kund:innen müssen ihn beim Abgeben und Abholen scannen.
es: Después de guardar, tu personal puede imprimir la pegatina QR. El cliente debe escanear el código al dejar y recoger.
ru: После сохранения персонал сможет распечатать QR-стикер. Клиент должен сканировать код при сдаче и выдаче.

# luggageDelegateAction
source: Deliver to emergency contact
de: An Notfallkontakt übergeben
es: Entregar a contacto de emergencia
ru: Передать аварийному контакту

# delegateInfoRequiredMessage
source: Please fill in the emergency contact details.
de: Bitte die Daten der Notfallperson ausfüllen.
es: Completa los datos del contacto de emergencia.
ru: Заполните данные аварийного контакта.

# howItWorksTitle
source: How it works
de: So funktioniert’s
es: Cómo funciona
ru: Как это работает

# pickupPinTitle
source: Pickup PIN
de: Abhol-PIN
es: PIN de recogida
ru: PIN выдачи

# pickupPinLabel
source: Pickup PIN
de: Abhol-PIN
es: PIN de recogida
ru: PIN выдачи

# pickupPinHint
source: 4-digit PIN
de: 4-stellige PIN
es: PIN de 4 dígitos
ru: 4-значный PIN

# pickupPinGenerated
source: Pickup PIN: {pin}
de: Abhol-PIN: {pin}
es: PIN de recogida: {pin}
ru: PIN выдачи: {pin}

# pickupPinRequiredMessage
source: Pickup PIN is required.
de: Abhol-PIN ist erforderlich.
es: El PIN de recogida es obligatorio.
ru: Нужен PIN выдачи.

# pickupPinInvalidMessage
source: PIN is incorrect. Try again.
de: PIN ist falsch. Bitte erneut versuchen.
es: El PIN es incorrecto. Inténtalo de nuevo.
ru: PIN неверный. Попробуйте снова.

# delegateSetupTitle
source: Delegate
de: Bevollmächtigte Person
es: Delegado
ru: Доверенное лицо

# delegateNameLabel
source: Full name
de: Vollständiger Name
es: Nombre completo
ru: Полное имя

# delegatePhoneLabel
source: Phone
de: Telefon
es: Teléfono
ru: Телефон

# delegateEmailLabel
source: Email
es: Correo

# delegateCodeTitle
source: Delegate Code
de: Bevollmächtigten-Code
es: Código de delegado
ru: Код доверенного лица

# delegateCodeLabel
source: Delegate code
de: Bevollmächtigten-Code
es: Código de delegado
ru: Код доверенного лица

# delegateCodeHint
source: 6-digit code
de: 6-stelliger Code
es: Código de 6 dígitos
ru: 6-значный код

# delegateCodeGenerated
source: Delegate code: {code}
de: Bevollmächtigten-Code: {code}
es: Código de delegado: {code}
ru: Код доверенного лица: {code}

# delegateCodeRequiredMessage
source: Delegate code is required.
de: Bevollmächtigten-Code erforderlich.
es: El código de delegado es obligatorio.
ru: Нужен код доверенного лица.

# delegateCodeInvalidMessage
source: Delegate code is invalid.
de: Bevollmächtigten-Code ist ungültig.
es: El código de delegado es inválido.
ru: Код доверенного лица неверный.

# delegateCodeExpiredMessage
source: Delegate code has expired.
de: Bevollmächtigten-Code ist abgelaufen.
es: El código de delegado ha expirado.
ru: Срок действия кода доверенного лица истек.

# delegateCodeUsedMessage
source: Delegate code has already been used.
de: Bevollmächtigten-Code wurde bereits verwendet.
es: El código de delegado ya fue usado.
ru: Код доверенного лица уже использован.

# delegateSavedMessage
source: Delegate saved.
de: Bevollmächtigte Person gespeichert.
es: Delegado guardado.
ru: Доверенное лицо сохранено.

# delegateEmergencyCodeTitle
source: Emergency Code
de: Notfallcode
es: Código de emergencia
ru: Экстренный код

# ownerInfoTitle
source: Owner Info
de: Besitzerinfo
es: Datos del propietario
ru: Данные владельца

# ownerNameLabel
source: Full name
de: Name
es: Nombre completo
ru: Полное имя

# ownerPhoneLabel
source: Phone
de: Telefon
es: Teléfono
ru: Телефон

# ownerEmailLabel
source: Email
es: Correo

# pickupPinSafetyWarning
source: Save your PIN and do not share it. This PIN will be required during pickup.
de: Speichere deine PIN und teile sie nicht. Diese PIN wird bei der Abholung benötigt.
es: Guarda tu PIN y no lo compartas. Se solicitará durante la recogida.
ru: Сохраните PIN и никому не сообщайте. Он понадобится при выдаче.

# pickupPinCopiedMessage
source: PIN copied — keep it in a safe place.
de: PIN kopiert — bewahre sie sicher auf.
es: PIN copiado — guárdalo en un lugar seguro.
ru: PIN скопирован — храните его в безопасном месте.

source: Copy
de: Kopieren
es: Copiar
ru: Копировать

# luggageCreateFailed
source: Luggage could not be created.
de: Gepäck konnte nicht erstellt werden.
es: No se pudo crear el equipaje.
ru: Не удалось создать багаж.

# savingInProgress
source: Saving...
de: Wird gespeichert...
es: Guardando...
ru: Сохранение...

# statusLabel
source: Status
es: Estado
ru: Статус

# permissionNameCamera
source: Camera
de: Kamera
es: Cámara
ru: Камера

# permissionNameLocation
source: Location
de: Standort
es: Ubicación
ru: Геолокация

# permissionNameNotifications
source: Notifications
de: Benachrichtigungen
es: Notificaciones
ru: Уведомления

source: Green
de: Grün
es: Verde
ru: Зелёный

# qrRegenerate
source: Regenerate
de: Neu erzeugen
es: Regenerar
ru: Создать заново

# locationPermissionDenied
source: Location permission not granted.
de: Standorterlaubnis nicht erteilt.
es: Permiso de ubicación no concedido.
ru: Доступ к геолокации не предоставлен.

# dropDatePickerHelp
source: Drop-off date
de: Abgabedatum
es: Fecha de entrega
ru: Дата сдачи

# pickupDatePickerHelp
source: Pickup date
de: Abholdatum
es: Fecha de recogida
ru: Дата выдачи

# addLuggageTitle
source: Create luggage
de: Gepäck anlegen
es: Crear equipaje
ru: Создать багаж

source: Total
de: Gesamt
ru: Итого

source: Color
de: Farbe
ru: Цвет

# dashboardTotalCount
source: Total {count}
de: Insgesamt {count}
ru: Всего {count}

# luggageInfoColor
source: Color: {value}
de: Farbe: {value}
ru: Цвет: {value}

# paymentTotalLabel
source: Total: {amount} TRY
de: Gesamt: {amount} TRY
ru: Итого: {amount} TRY

# pricingTotalLabel
source: Total
de: Gesamt
ru: Итого
